google.geminicodeassist
kylinideteam.cmake-intellisence
kylinideteam.cppdebug
kylinideteam.kylin-cmake-tools
llvm-vs-code-extensions.vscode-clangd
mhutchie.git-graph
streetsidesoftware.code-spell-checker
twxs.cmake
vivaxy.vscode-conventional-commits
vizzletf.geminicommit
